#puts стрічка_короля =  "Власнисть його Величносте Короля"
#puts стрічка_задом_наперед = стрічка_короля.reverse
#puts повторіть = 3
#puts стрічка_з_ехо = стрічка_короля * повторіть
#puts стрічка_короля
#puts стрічка_задом_наперед
#Eputs стрічка_з_ехо


# тиск_води = 100
# "Тиск води на початку: #{тиск_води}."
# тиск_води = 100 / 2
# puts "Тиск води тепер: #{тиск_води}"



#водомат_увімк = true
#є_вода = true
#if водомат_увімк && є_вода
#  тикс_води = 50
#end

#while true
#  if на_зупинці?
#    зупинити_поїзд
#    break
#   else
#    їхати_вперед
#    break
#  end
#end
#

#список_товарів = ["сир","хліб","виноград","святкова шапка на всі випадки життя"]
#for товар in cписок_товарів
#  next if товар.length.odd?
#  puts товар
#end

#перше_замовлення = ['яйце жовтком дороги','яйце жовтком догор','яйце жовтком догори']
#друге_замовлення = Array.new(3, 'яйце жовтком до гори')
#третє_замовлення = ['деруни']
#четверте_камовлення = ['яечня','деруни']
#черга_замовлень = [перше_замовлення,друге_замовлення,третє_замовлення,четверте_камовлення]
# p черга_замовлень
# p f = черга_замовлень
#p черга_замовлень.sample

#p rand(3..20)
#p черга_замовлень.sample

#p rand(3..20)

# складові_сніданку = ['яєчня','деруни','підлива','ковбаска','оладки','повидло']
# наступна_страва = складові_сніданку.shift
 # p наступна_страва

# 'складові_сніданку'

#наступна_страва = складові_сніданку.pop
# p наступна_страва

#наші_герої =  {
#  :король => 'правитель всього короліства',
#  :рубен => 'Ruby-чарівник на навчанні',
#  :скарлет =>'Ruby-чарівницяна навчанні',
#  :кремезний_генк =>'власник Трапезної',
#  :писклявий_джо => 'кухар-підсмажувач у Трапезній'
#}
#наші_герої[:король]

#p поточна_температура = (100..200)[0]
 #p ('a'..'д').to_a
#p (1..9).to_a

#поточина_температура = (100..200).first
# p поточина_температура

#види_повидла = ['малинове','полуничне','сливове']
#p види_повидла

#замовлення = ['хрусткий бекон','хрусткий бекон','хрусткий бекон']
#p замовлення

#замовленя = Array.new(3, 'хрусткий бекон')
#p замовленя

пустий_масив = []
p пустий_масив.empty?

не_пустий_масив = [1,2,3,4,5,'зранку вчусь я рахувать']
p не_пустий_масив.empty?

p не_пустий_масив.length

p не_пустий_масив.first

p не_пустий_масив.last

p не_пустий_масив

p перший_елемент = не_пустий_масив.shift
перший_елемент



















